# Project 2

In [1]:
import pandas as pd
import seaborn as sns

### CO2 from 800kyrs to present

In [6]:
CO2df=pd.read_csv('composite_co2_800kyrs_to_present.csv')

In [7]:
CO2df

,Composite CO2 record (0-800 kyr BP),Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7
0,0-22 kyr BP:,Dome C (Monnin et al. 2001) measured at Univer...,NaN,NaN,NaN,NaN,NaN,NaN
1,22-393 kyr BP:,Vostok (Petit et al. 1999; Pepin et al. 2001; ...,NaN,NaN,NaN,NaN,NaN,NaN
2,393-416 kyr BP:,Dome C (Siegenthaler et al. 2005) measured at ...,NaN,NaN,NaN,NaN,NaN,NaN
3,416-664 kyr BP:,Dome C (Siegenthaler et al. 2005) measured at...,NaN,NaN,NaN,NaN,NaN,NaN
4,664-800 kyr BP:,Dome C (Luethi et al. (sub)) measured at Unive...,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...
5801,NaN,NaN,5796 3187.25 797408 -440....,NaN,NaN,NaN,NaN,NaN
5802,NaN,NaN,5797 3187.8 798443 -43...,NaN,NaN,NaN,NaN,NaN
5803,NaN,NaN,5798 3188.35 799501 -441....,NaN,NaN,NaN,NaN,NaN
5804,NaN,NaN,5799 3188.9 800589 -441.4...,NaN,NaN,NaN,NaN,NaN
5805,NaN,NaN,5800 3189.45 801662 -440....,NaN,NaN,NaN,NaN,NaN

### Irish Data

In [ ]:
df = pd.read_csv("https://www.met.ie/cms/assets/uploads/2018/01/Long-Term-IIP-1711-2016.zip")

In [ ]:
df

      Year  Month  Median montly series
0     1711      1                  16.4
1     1711      2                  73.1
2     1711      3                 121.2
3     1711      4                  85.2
4     1711      5                  66.6
...    ...    ...                   ...
3667  2016      8                  79.1
3668  2016      9                 108.1
3669  2016     10                  51.8
3670  2016     11                  58.0
3671  2016     12                  92.1

[3672 rows x 3 columns]

In [ ]:
df['Date'] = pd.to_datetime(df['Year'].astype(str) + 
                                        df['Month'].astype(str), format='%Y%m')

In [ ]:
df

      Year  Month  Median montly series       Date
0     1711      1                  16.4 1711-01-01
1     1711      2                  73.1 1711-02-01
2     1711      3                 121.2 1711-03-01
3     1711      4                  85.2 1711-04-01
4     1711      5                  66.6 1711-05-01
...    ...    ...                   ...        ...
3667  2016      8                  79.1 2016-08-01
3668  2016      9                 108.1 2016-09-01
3669  2016     10                  51.8 2016-10-01
3670  2016     11                  58.0 2016-11-01
3671  2016     12                  92.1 2016-12-01

[3672 rows x 4 columns]

In [ ]:
sns.lineplot(data=df, x='Date', y='Median montly series', )

NameError: name 'df' is not defined

### References

https://www.marsja.se/combine-year-and-month-columns-in-pandas/